GreatCowBASIC/DATFileGenerator/incfiles/p16F17544.inc
;----- CM1CON1 Bits -----------------------------------------------------
INTN_CM1CON1     EQU  H'0000'
INTP_CM1CON1     EQU  H'0001'
RDY              EQU  H'0007'
C1INTN           EQU  H'0000'
C1INTP           EQU  H'0001'
C1RDY            EQU  H'0007'
SP0              EQU  H'0002'
C1SP0            EQU  H'0002'


;----- CM1NCH Bits -----------------------------------------------------
NCH0             EQU  H'0000'
NCH1             EQU  H'0001'
NCH2             EQU  H'0002'
C1NCH0           EQU  H'0000'
C1NCH1           EQU  H'0001'
C1NCH2           EQU  H'0002'


;----- CM1PCH Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
C1PCH0           EQU  H'0000'
C1PCH1           EQU  H'0001'
C1PCH2           EQU  H'0002'


;----- CMLP1CON0 Bits -----------------------------------------------------
SYNC_CMLP1CON0   EQU  H'0000'
POL_CMLP1CON0    EQU  H'0004'
OUT_CMLP1CON0    EQU  H'0006'
EN               EQU  H'0007'
CLP1SYNC         EQU  H'0000'
CLP1POL          EQU  H'0004'
CLP1OUT          EQU  H'0006'
CLP1EN           EQU  H'0007'


;----- CMLP1CON1 Bits -----------------------------------------------------
INTN_CMLP1CON1   EQU  H'0000'
INTP_CMLP1CON1   EQU  H'0001'
CLP1INTN         EQU  H'0000'
CLP1INTP         EQU  H'0001'
CMR0             EQU  H'0004'
CMR1             EQU  H'0005'
CLP1CMR0         EQU  H'0004'
CLP1CMR1         EQU  H'0005'


;----- CMLP1NCH Bits -----------------------------------------------------
NCH0             EQU  H'0000'
NCH1             EQU  H'0001'
NCH2             EQU  H'0002'
CLP1NCH0         EQU  H'0000'
CLP1NCH1         EQU  H'0001'
CLP1NCH2         EQU  H'0002'


;----- CMLP1PCH Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
CLP1PCH0         EQU  H'0000'
CLP1PCH1         EQU  H'0001'
CLP1PCH2         EQU  H'0002'


;----- CMOUT Bits -----------------------------------------------------
C1OUT_CMOUT      EQU  H'0000'
CLP1OUT          EQU  H'0001'


;----- DAC2CON Bits -----------------------------------------------------
NSS              EQU  H'0000'
REFRNG           EQU  H'0006'
EN               EQU  H'0007'
PSS0             EQU  H'0002'
PSS1             EQU  H'0003'
OE0              EQU  H'0004'
OE1              EQU  H'0005'


;----- OPA1CON0 Bits -----------------------------------------------------
UG               EQU  H'0003'
EN               EQU  H'0007'
UG0              EQU  H'0003'
OPA1UG           EQU  H'0003'
OPA1EN           EQU  H'0007'


;----- OPA1CON2 Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
PCH3             EQU  H'0003'
FMS0             EQU  H'0006'
FMS1             EQU  H'0007'
OPA1PCH0         EQU  H'0000'
OPA1PCH1         EQU  H'0001'
OPA1PCH2         EQU  H'0002'
OPA1PCH3         EQU  H'0003'
OPA1FMS0         EQU  H'0006'
OPA1FMS1         EQU  H'0007'


;----- OPA1CON3 Bits -----------------------------------------------------
NCH0             EQU  H'0000'
NCH1             EQU  H'0001'
NCH2             EQU  H'0002'
NCH3             EQU  H'0003'
OPA1NCH0         EQU  H'0000'
OPA1NCH1         EQU  H'0001'
OPA1NCH2         EQU  H'0002'
OPA1NCH3         EQU  H'0003'


;----- OPA1OFFSET Bits -----------------------------------------------------
OFFSET0          EQU  H'0000'
OFFSET1          EQU  H'0001'
OFFSET2          EQU  H'0002'
OFFSET3          EQU  H'0003'
OFFSET4          EQU  H'0004'
OFFSET5          EQU  H'0005'
OFFSET6          EQU  H'0006'
OFFSET7          EQU  H'0007'
OPA1OFFSET0      EQU  H'0000'
OPA1OFFSET1      EQU  H'0001'
OPA1OFFSET2      EQU  H'0002'
OPA1OFFSET3      EQU  H'0003'
OPA1OFFSET4      EQU  H'0004'
OPA1OFFSET5      EQU  H'0005'
OPA1OFFSET6      EQU  H'0006'
OPA1OFFSET7      EQU  H'0007'


;----- OPA1CON4 Bits -----------------------------------------------------
OFCST            EQU  H'0002'
OFCSEL0          EQU  H'0000'
OFCSEL1          EQU  H'0001'
OPA1OFCST        EQU  H'0002'
OPA1OFCSEL0      EQU  H'0000'
OPA1OFCSEL1      EQU  H'0001'


;----- NVMADR Bits -----------------------------------------------------
NVMADR0          EQU  H'0000'
NVMADR1          EQU  H'0001'
NVMADR2          EQU  H'0002'
NVMADR3          EQU  H'0003'
NVMADR4          EQU  H'0004'
NVMADR5          EQU  H'0005'
NVMADR6          EQU  H'0006'
NVMADR7          EQU  H'0007'


;----- NVMADRH Bits -----------------------------------------------------
NVMADR8          EQU  H'0000'
NVMADR9          EQU  H'0001'
NVMADR10         EQU  H'0002'
NVMADR11         EQU  H'0003'
NVMADR12         EQU  H'0004'
NVMADR13         EQU  H'0005'
NVMADR14         EQU  H'0006'


;----- NVMDAT Bits -----------------------------------------------------
NVMDAT0          EQU  H'0000'
NVMDAT1          EQU  H'0001'
NVMDAT2          EQU  H'0002'
NVMDAT3          EQU  H'0003'
NVMDAT4          EQU  H'0004'
NVMDAT5          EQU  H'0005'
NVMDAT6          EQU  H'0006'
NVMDAT7          EQU  H'0007'


;----- NVMDATH Bits -----------------------------------------------------
NVMDAT8          EQU  H'0000'
NVMDAT9          EQU  H'0001'
NVMDAT10         EQU  H'0002'
NVMDAT11         EQU  H'0003'
NVMDAT12         EQU  H'0004'
NVMDAT13         EQU  H'0005'


;----- NVMCON1 Bits -----------------------------------------------------
RD               EQU  H'0000'
WR               EQU  H'0001'
WREN             EQU  H'0002'
WRERR            EQU  H'0003'
FREE             EQU  H'0004'
LWLO             EQU  H'0005'
NVMREGS          EQU  H'0006'


;----- SCANCON0 Bits -----------------------------------------------------
INTM             EQU  H'0003'
DABORT           EQU  H'0004'
BUSY             EQU  H'0005'
SGO              EQU  H'0006'
EN               EQU  H'0007'


;----- CRCDATA Bits -----------------------------------------------------
DATA0            EQU  H'0000'
DATA1            EQU  H'0001'
DATA2            EQU  H'0002'
DATA3            EQU  H'0003'
DATA4            EQU  H'0004'
DATA5            EQU  H'0005'
DATA6            EQU  H'0006'
DATA7            EQU  H'0007'


